var util = require('../../utils/util.js')

Page({
  data: {
    second_height: 0,
    suitable: [
      ["0月占位符，没有用到"],
      //1月
      [
        ["0100", "日期占位符，没有用到"],
        ["0101", "岁月轮回，我们都回不到最初样子\n那就收拾心情，继续前行", "宜期待"],
        ["0102", "你是我的嘴角独特，我是你的最佳读者.", "宜欣赏"],
        ["0103", "愿你在最无趣的日子仍对世界充满好奇，撑不住了就去睡一觉，等一等，说不定随时绽放奇迹。", "宜好奇"],
        ["0104", "有一次大雄睡不著哆啦A梦问他在想什么，「想著人生的种种，就睡不着了。」", "宜幻想"],
        ["0105", "爱情是不由自主的，得来容易就看得容易，没得到的，或者得不到的，才觉得稀罕珍贵。", "宜珍惜"],
        ["0106", "我们都是和自己赛跑的人，为了更好地未来，拼命努力，争取一种意义非凡的胜利。", "宜义无反顾"],
        ["0107", "战争就是这样，双方都认为自己是好的一方。", "宜看清"],
        ["0108", "哆啦A梦 ：“大人真可怜呐。没人比自己大。找不到人依靠撒娇，也没人能责骂自己。”", "宜怀念"],
        ["0109", "如果再见不能红着脸，是否还能红着眼.", "匆匆那年"],
        ["0110", "纸短情长啊，诉不完当时年少，我的故事还是关于你呀.", "《纸短情长》"],
        ["0111", "成长是一笔交易，我们都是用朴素的童真与未经人事的洁白交换长大的勇气。", "宜成长"],
        ["0112", "什么时候，我们话少的只剩早安晚安了。", "忌无聊"],
        ["0113", "一盅清茶，喝到凉却。一出戏，看到落幕。一生要修的功课，也会在某个掩卷的时刻，写上结局。", "忌碌碌无为"],
        ["0114", "青春就像一场大雨，即使感冒了，也希望再淋一次。", "宜疯狂"],
        ["0115", "我喜欢你，是我独家的记忆\n谁也不行，从我这个身体中拿走你", "《独家记忆》"],
        ["0116", "每一次告别，最好用力一点。\n多说一句，可能是最后一句。\n多看一眼，可能是最后一眼。", "忌错过"],
        ["0117", "思想如电钻，必须集中在一点钻下去才有力量。", "宜专注"],
        ["0118", "我发现好看的皮囊太多，于是我只能逼着自己的灵魂有声有色。", "宜有趣"],
        ["0119", "不管我们能不能再见，不管你会不会忘了我。", "忌相忘"],
        ["0120", "如果你说你在下午四点来，从三点钟开始，我就开始感觉很快乐，时间越临近，我就越来越感到快乐。", "《小王子》"],
        ["0121", "愿你活成自己喜爱的模样，不必取悦任何人也不无故讨厌某个人。", "宜洒脱"],
        ["0122", "愿你有盔甲也有软肋。善良得有原则，感性得有底线。", "宜有原则"],
        ["0123", "哆啦A梦 ：“大人真可怜呐。没人比自己大。找不到人依靠撒娇，也没人能责骂自己。”", "宜童真"],
        ["0124", "淡然，是人生的一种成长。别让生活的压力挤走快乐，收拾心情，重新上路。", "宜淡然"],
        ["0125", "我不会在意外部给我的标签，因为他们只是想记住我。", "宜自嘲"],
        ["0126", "现在执着追求的事，将来有一天也会变得不重要的。", "宜把握"],
        ["0127", "生活坏到一定程度就会好起来，因为它无法更坏。努力过后，才知道许多事情，坚持坚持，就过来了。", "《龙猫》"],
        ["0128", "福是什么？知道福是什么就是福。", "宜知福"],
        ["0129", "如果你爱上了某个星球的一朵花。那么，只要在夜晚仰望星空，就会觉得漫天的繁星就像一朵朵盛开的花。", "宜守护"],
        ["0130", "有一碗米给人家吃，自我饿着肚子，这叫帮人；一锅米你吃不了，给人家盛一碗，那叫人家帮你。", "《姥姥语录》"],
        ["0131", "姥姥说：“神就是你自我，你信他就有，你不信他就没有。”", "《姥姥语录》"],
      ],
      //2月
      [
        ["0200", "日期占位符，没有用到"],
        ["0201", "刚开始是假装坚强，后来就真的坚强了。", "《我们仨》"],
        ["0202", "语言是误解的源头。", "忌谎言"],
        ["0203", "所有的大人都曾经是小孩\n虽然，只有少数的人记得。", "宜初心"],
        ["0204", "像每一滴酒回不了最初的葡萄，我回不到年少。", "宜一往无前"],
        ["0205", "陪伴是最长情的告白.", "宜陪伴"],
        ["0206", "传说在北极的人因为天寒地冻，一开口说话就结成冰雪，对方听不见，只好回家慢慢地烤来听……", "宜聆听"],
        ["0207", "原来我们的改变，都是那么地容易。", "忌圆滑"],
        ["0208", "不开心的时候对着镜子里的自己笑笑，不要总是把笑容留给别人，也要分一点给自己。", "宜自爱"],
        ["0209", "欲言又止的次数太多了，最后导致连想开口的念头都没了。", "宜表达"],
        ["0210", "海边，蔚蓝色的海边， 盖一个小木屋子，蓝天白云，太阳每一天都把沙滩晒得暖洋洋的。", "宜憧憬"],
        ["0211", "只有用心灵才能看得清事物本质，真正重要的东西是肉眼无法看见的。", "宜感受"],
        ["0212", "人间不会有单纯的快乐，快乐总夹杂着烦恼和忧虑，人间也没有永远。", "《我们仨》"],
        ["0213", "你的问题在于书读得不多而想得太多。", "忌浮躁"],
        ["0214", "很多时候我们放弃，以为不过是一段感情\n到了最后，才知道\n原来那是一生", "宜珍惜"],
        ["0215", "如果将人生一分为二，那么我们前半段人生哲学应该是“不犹豫”，而后半段的人生哲学应该是“不后悔”。", "忌等待"],
        ["0216", "我只是一滴清水，不是肥皂水，不能吹泡泡。", "忌浮夸"],
        ["0217", "星星发亮是为了让每一个人有一天都能找到属于自己的星星。", "宜信仰"],
        ["0218", "当我们开始寻求，我们就已经失去，而我们不开始寻求，我们根本无法知道自己身边的一切是如此可贵。", "宜出发"],
        ["0219", "没有人的时候，把脑子拿出来在太阳底下晒晒，浑身简单好多。人的两条腿不能走得太快，太快了魂儿跟不上。没有魂的人就常做错事傻事。", "《姥姥语录》"],
        ["0220", "如果把童年再放映一遍，我们一定会先大笑，然后放声痛哭，最后挂着泪，微笑着睡去。", "宜无悔"],
        ["0221", "或者为此，风一辈子不能平静，和人的感情一样。", "宜平淡"],
        ["0222", "平淡是真，普通是好，这都是懒人说的话。你去问问山顶上的人，他要是和你说实话，他保准说她这一辈子不后悔。下辈子他还上山顶。", "宜阅历"],
        ["0223", "终结一条道路唯一的方式就是走完它，从此之后断了这个念想，也好。", "宜经历"],
        ["0224", "人间不会有单纯的快乐，快乐总夹杂着烦恼和忧虑，人间也没有永远。", "《我们仨》"],
        ["0225", "用心看着人，用心和人说话。别觉着自我比人家高，也别怕自我比人家矮。", "忌自卑"],
        ["0226", "姥姥说：人说话，一半儿用嘴说，一半儿用心说。用嘴说的话你倒着听就行了，用心说的话才是真的。", "《姥姥语录》"],
        ["0227", "所谓心事，不过是不如己意，那就是我执，执著于自己描画的理想，一有落差，即生烦恼。", "忌闷闷不乐"],
        ["0228", "我和谁都不争，和谁争我都不屑。简朴的生活、高贵的灵魂是人生的至高境界。", "宜看透"],
        ["0229", "姥姥说：吃了一辈子小亏，占了一辈子大便宜……一辈子没有大幸福，小幸福一天一个。", "宜知足"],
        ["0230", "不要盲目崇拜任何权威，因为你总能找到相反的权威。", "忌轻信"],
        ["0231", "有一次，大雄一直喝果汁饮料被妈妈骂说这样对身体不好，叫他口渴就喝水啊。大雄碎碎念「又不是金鱼，喝什么水」", "宜天真"],
      ],

      //3月
      [
        ["0300", "日期占位符，没有用到"],
        ["0301", "“大雄，如果要允许你许个愿望，你会最想要许的是什么。”“我想要哆啦A梦永远陪在我身边，永远不离开我。", "宜情谊"],
        ["0302", "哆啦A梦曾经问大雄：“如果给你一个没有口袋的哆啦A梦，你还要么？”  “哈哈，那就不要了”回答的很干脆。于是，继续笑闹着，嘲笑着彼此的贪心。", "宜单纯"],
        ["0303", "一次大雄考零分，老师很生气，说为什么考零分。大雄：“零分是老师给的”", "宜有趣"],
        ["0304", "年轻的时候以为不读书不足以了解人生，直到后来才发现如果不了解人生，是读不懂书的。读书的意义大概就是用生活所感去读书，用读书所得去生活吧。", "宜阅历"],
        ["0305", "大雄“我不想长高” “为什么” “因为我长高了哆啦A梦就不能牵到我的手了。”", "宜友谊"],
        ["0306", "今后还会不断地栽跟头，但同时你也有了每次站起来的坚强。", "忌停滞不前"],
        ["0307", "哆啦A梦对大雄说：“你学什么都是这个样子，还没开始学就先退缩，你这样子学什么都不会。”", "宜真心"],
        ["0308", "你看，不倒翁站起来了，你也可以自己站起来啊！", "宜鼓励"],
        ["0309", "我们最熟悉的事物，往往是我们最不了解的。", "忌舒适"],
        ["0310", "有没有那么一个人，教会你成长，却没有陪你到最后。", "宜珍惜"],
        ["0311", "这世界笑了于是你合群的一起笑了。", "宜真心快乐"],
        ["0312", "人生的某些障碍，你是逃不掉的。与其费尽周折绕过去，不如勇敢的地攀越，或许这会铸就你人生的高点。", "宜攀登"],
        ["0313", "在现实面前，请收起你的多愁善感。", "宜坚强"],
        ["0314", "全部都依赖别人的话永远都不能成为独当一面的人，所谓选择道路，并不一定要选择好走又安全的道路。有什么不好，就算迟了也要努力到最后。", "宜努力"],
        ["0315", "子的颜色也是金黄色的，它会让我想起你。而且我也将喜欢聆听风儿吹过麦田的声音。", "《小王子》"],
        ["0316", "有些东西，在别人看来可能一无是处，但却承载了只属于自己的珍贵回忆。", "宜回忆"],
        ["0317", "哆啦A梦 ：“炫耀、逞威风之类有什么好的。自己开心不就很好吗？”", "忌合群"],
        ["0318", "现在的梦想决定着你的将来，还是再睡一会吧。", "宜幽默"],
        ["0319", "既然选择了远方，便只顾风雨兼程。", "忌后悔"],
        ["0320", "那些真正喜欢的人和事，都值得我们去坚持。", "宜坚持"],
        ["0321", "如果要在正确和善良中做选择，请选择善良。", "《奇迹男孩》"],
        ["0322", "我们夫妇常说：但愿多一二知己，不要众多不相知的人闻名。", "《杂忆与杂写》"],
        ["0323", "不是的，我也很喜欢静香，但我不希望这样靠机械（多啦A梦的道具）来获得你的心。", "宜认真"],
        ["0324", "快乐、陪伴、被关爱、不寂寞……这些，都是最清澈和最纯粹的。", "宜纯粹"],
        ["0325", "也许生存在世间的人们都只是在等待一种偶遇，一种适时的相遇，时间对了，你们便会遇上。", "宜等待"],
        ["0326", "明白的道理就不是哲理了，哲理本来就是不明不白的道理。", "宜文艺"],
        ["0327", "什么时候我们开始无法像孩子一样肆意地大呼小叫了?心里的小情绪堆积得像山一样高，直到溢出来。", "忌沉重"],
        ["0328", "后来的我们什么都有了，只是，没有我们了。", "忌错过"],
        ["0329", "把每天的小努力累积起来改变历史。", "宜进步"],
        ["0330", "虽然犯错是人类的缺点，但是从错误中学习是人类的优点。", "宜总结"],
        ["0331", "走好选择的路，别选择好走的路，你才能拥有真正的自己。", "宜真我"],
      ],
      //4月
      [
        ["0400", "日期占位符，没有用到"],
        ["0401", "心里有气有怨说出来就好了，不管真对真错，别留着，留着日子长了，就长在身体里了。", "宜洒脱"],
        ["0402", "“我们来下象棋好了，我会故意输给你的！”", "忌较真"],
        ["0403", "很多时候，千言万语都抵不过一个拥抱。 ", "宜深情"],
        ["0404", "哆啦还在，一直在\n他是真的，从不是一场梦。", "宜相信"],
        ["0405", "毫无理想而又优柔寡断是一种可悲的心理。", "宜果断"],
        ["0406", "时间就像一张网，你撒在那里，你的收获就在那里。", "宜付出"],
        ["0407", "友谊的小船，说不翻就永远不翻！", "宜执着"],
        ["0408", "世间好物不坚牢，彩云易散琉璃脆。", "忌脆弱"],
        ["0409", "美好的爱情大都相似，而不幸的爱情最后都成了故事，如果当时你没走，后来的我们会不会不一样?", "《后来的我们》"],
        ["0410", "不管前方的路有多苦，只要走的方向正确，不管多么崎岖不平，都比站在原地更接近幸福。", "宜拥抱"],
        ["0411", "只有阳光而无阴影，只有欢乐而无痛苦，那就不是人生。", "忌灰暗"],
        ["0412", "你应该要学着做你自己，面对真实的自我，只要做到这一点，你就不会害怕任何事情了。", "宜做自己"],
        ["0413", "不知道离别的滋味是这样凄凉，我不知道说声再见要这么坚强。", "宜感动"],
        ["0414", "这个时代缺的不是完美的人，缺的是从自己心里给出真心的人。", "宜清澈"],
        ["0415", "地球是运动的，人不会永远处在倒霉的位置。", "宜无畏"],
        ["0416", "我始终认为一个人可以很天真简单的活下去，必是身边无数人用更大的代价守护而来的。", "忌青涩"],
        ["0417", "自己的路，还是得自己走。", "宜全力以赴"],
        ["0418", "用善意的心情去理解别人的话，会让世界单纯美好容易。世界如此之大，我却能幸运地遇见一些人。", "宜扪心自问"],
        ["0419", "一个人经过不同程度的锻炼，就获得不同程度的修养、不同程度的效益。", "宜锻炼"],
        ["0420", "姥姥说：吃哑巴亏的人心里都有数，沾哑巴光的人心里更有数。", "《姥姥语录》"],
        ["0421", "我是真心的喜欢静香，我觉得我不在她身边是最好的。虽然离开静香会很痛苦的，如果因为我让她变得不幸的话，我会更痛苦的。", "宜体谅"],
        ["0422", "最远的旅行，是从自己的身体到自己的心，是从一个人的心到另一个人的心。", "宜阳光"],
        ["0423", "有时候，坚持了你最不想干的事情之后，便可得到你最想要的东西。", "宜投入"],
        ["0424", "有时我沉默，不是不快乐，只是想把心净空。有时候你需要退开一点，清醒一下，然后提醒自己，我是谁，要去哪里。", "宜思考"],
        ["0425", "回忆是一种很奇妙的东西，它生活在过去，存在于现在，却能影响未来。", "宜思念"],
        ["0426", "一旦你驯服了什么，就要对她负责，永远的负责。", "《小王子》"],
        ["0427", "人永远不知道，谁哪次不经意的跟你说了再见之后，就真的不会再见了。", "忌匆匆"],
        ["0428", "就算不快乐也不要皱眉，因为你永远不知道谁会爱上你的笑容。", "宜快乐"],
        ["0429", "缘分这事，能不负对方就好，想不负此生真的很难。", "《后来的我们》"],
        ["0430", "日子就像偷跑的小孩，无声地溜走。", "宜惜时"],
        ["0431", "我甘心当个“零”，人家不把我当个东西，我正好可以把看不起我的人看个透。", "宜平凡"],
      ],
      //5月
      [
        ["0500", "日期占位符，没有用到"],
        ["0501", "闪电风暴过后，一定是那充满蓝天白云，充满碧草繁花的世界。", "宜劳动"],
        ["0502", "真正幸运的人，不一定在赌桌上拿一手好牌，但懂得什么时候离桌。", "宜自省"],
        ["0503", "我们的孤独就像天空中漂浮的城市，仿佛是一个秘密，却无从述说。", "忌孤独"],
        ["0504", "一举一动，都是承诺，会被另一个人看在眼里，记在心上的。", "忌相忘"],
        ["0505", "成长，是每个孩子的权力，也是他们必经的征程，或平坦、或崎岖，有悲欢，有离合。", "宜成长"],
        ["0506", "人生至少要有两次冲动，一为奋不顾身的爱情，一为说走就走的旅行。", "宜出走"],
        ["0507", "哆啦A梦，哆啦A梦，就像它的名字，多啦只是一个梦。", "宜想象"],
        ["0508", "认清这个世界，然后爱它。就这么一辈子，下一世你可能就不在这个世界了。有些烦恼，丢掉了，才有风轻云淡的机会。", "忌难忘"],
        ["0509", "即使是在混乱的时代，也有很好的东西，也有激励我们的东西。", "忌一叶障目"],
        ["0510", "你在你的玫瑰花身上耗费的时间使得你的玫瑰花变得如此重要。", "宜投入"],
        ["0511", "当我站在软软的沙滩上，抬眼望去，蔚蓝色的天空里悬浮着几朵绸缎般的白云。", "宜美好"],
        ["0512", "妈妈是世界上最温柔的女汉纸！", "宜感恩"],
        ["0513", "人总在记忆中沉沦，为路过我们生命的那些人哭着，笑着。", "忌难忘"],
        ["0514", "最可怕最可悲的事情不是丢掉理想，而是看着理想成为笑谈。", "忌挥霍"],
        ["0515", "苍不会让所有幸福集中到某个人身上，得到爱情未必得到金钱，拥有金钱未必拥有快乐，得到快乐未必拥有健康，拥有健康未必一切都如愿以偿。", "《百岁感言》"],
        ["0516", "如果没有任意门、没有时光机、没有竹蜻蜓、没有记忆面包，如果只是一只简单的讲义气的机器猫，是不是就没有那么喜欢、那么想去得到了。", "忌物质"],
        ["0517", "多年后，再回想这样的迷茫或许连执着的原因都记不得了，青春就是让你张扬的笑，也给你莫名的痛。", "宜青春"],
        ["0518", "珍惜一切，就算没有拥有。", "《稻香》"],
        ["0519", "夏日的海真是吸引人，赤脚走在热乎乎细密柔软的沙滩上，会感到特别舒服", "宜打盹儿"],
        ["0520", "永远年轻，永远热泪盈眶。", "宜理想主义"],
        ["0521", "许多良辰美景\n想和你一个一个去耽误。", "宜享受"],
        ["0522", "不要因为好强而把争论升级为争吵，我不认为让步的一方是软弱的，事实上，让步才是明智之举。", "宜谦让"],
        ["0523", " 世界这么大，而找到真正喜欢可以落脚的地方，又实在是难。", "忌伤怀"],
        ["0524", "有一次大雄睡不著哆啦A梦问他在想什么，「想著人生的种种，就睡不着了。」", "忌熬夜"],
        ["0525", "爱情是不由自主的，得来容易就看得容易，没得到的，或者得不到的，才觉得稀罕珍贵。", "忌有恃无恐"],
        ["0526", "我们都是和自己赛跑的人，为了更好地未来，拼命努力，争取一种意义非凡的胜利。", "忌无所事事"],
        ["0527", "战争就是这样，双方都认为自己是好的一方。", "忌对抗"],
        ["0528", "哆啦A梦 ：“大人真可怜呐。没人比自己大。找不到人依靠撒娇，也没人能责骂自己。”", "宜孩子气"],
        ["0529", "淡然，是人生的一种成长。别让生活的压力挤走快乐，收拾心情，重新上路。", "宜淡然"],
        ["0530", "我不会在意外部给我的标签，因为他们只是想记住我。", "忌以己度人"],
        ["0531", "现在执着追求的事，将来有一天也会变得不重要的。", "忌以假乱真"],
      ],
      //6月
      [
        ["0600", "日期占位符，没有用到"],
        ["0601", "我最大的遗憾\n是你的遗憾，与我有关", "忌袖手旁观"],
        ["0602", "有苦也不是坏事，苦多了甜就比出来了。你吃一块儿桃酥试试，又甜又香，你再吃一斤试试？你那嘴呀就想找块咸菜往嘴里放。孩子，别怕苦，苦它的兄弟就叫甜那！", "《姥姥语录》"],
        ["0603", "念书的人不管长啥样，你仔细看都好看；书念得越多人长得越俊。没念过书的人眼神都是傻的。", "《姥姥语录》"],
        ["0604", "人虽然渺小，人生虽然短促，但是人能学，人能修身，人能自我完善，人的可贵在人自身。", "《杂忆与杂写》"],
        ["0605", "当陪你的人要下车时，即使不舍，也该心存感激，然后挥手道别。", "宜感激"],
        ["0606", "海的那边是什么？海的那边是海岛吧？", "宜偷懒"],
        ["0607", "流血流汗不流泪，掉皮掉肉不掉队\n只要学不死，就往死里学\n提高一分，干掉千人", "宜怀念高考"],
        ["0608", "每个人的成长过程或多或少都会有过那么一个教你学会成长，难以忘怀的Ta吧！", "忌忘怀"],
        ["0609", "人生的列车岂止一站，我们会沿着各自的方向，开往不同的地方。", "忌复制"],
        ["0610", "爱生活的人，往往都容易被人爱。", "宜热爱"],
        ["0611", "这个星期六，我妈妈就会回来了。", "《龙猫》"],
        ["0612", "人总是活在矛盾当中，对人类的绝望以及信赖，我们在这夹缝间求生存。", "忌水逆"],
        ["0613", "使沙漠显得美丽的，是它在什么地方藏着一口水井。", "宜憧憬"],
        ["0614", "如果他总为别人撑伞，你何苦非为他等在雨中。", "忌徒劳"],
        ["0615", "我没说话，不意味着我心情差。有时候，我就是想安静点。", "宜体谅"],
        ["0616", "父爱，最重要的是有担当。", "宜感恩父亲"],
        ["0617", "一个人的时候，怎么过？就算再难以承受，其实到最后我们总能走得过来。", "忌黏人"],
        ["0618", "大雄，只要你需要我，我就会出现在你身旁。", "宜挂念"],
        ["0619", "吃货的幸福你们是不会懂的！", "宜心安理得"],
        ["0620", "我猜着了开头，但我猜不中这结局。", "宜缅怀"],
        ["0621", "你的回忆开始沉没 你的眼神再次清澈。", "宜新生"],
        ["0622", "也许世界上也有五千朵和你一模一样的花，但只有你是我独一无二的玫瑰。", "宜驯养"],
        ["0623", "开始的开始，我们都是孩子\n最后的最后，渴望变成天使 ", "宜歌唱"],
        ["0624", "最美的不是下雨天，是曾与你躲过雨的屋檐。", "宜爱无止境"],
        ["0625", "岁月轮回，我们都回不到最初样子\n那就收拾心情，继续前行", "宜期待"],
        ["0626", "你是我的嘴角独特，我是你的最佳读者。", "宜蜜语甜言"],
        ["0627", "围在城里的人想逃出来，站在城外的人想冲进去，婚姻也罢、事业也罢，人生的欲望大都如此。", "忌贪婪"],
        ["0628", "你比自己更重要。我也希望变更好。", "宜促进"],
        ["0629", "跟别人互相理解是很难的，不过对谁来说都一样。", "宜相知"],
        ["0630", "两个人散了是因为一个以为不会走，一个以为会挽留。", "忌后悔"],
        ["0631", "哆啦A梦 ： “即便逃进梦想的世界，醒来时只会变得悲惨不是么！！必须在现实世界里努力。”", "宜努力"],
      ],
      //7月
      [
        ["0700", "日期占位符，没有用到"],
        ["0701", "如果当时我们能不那么倔强，现在也不那么遗憾。", "《后来》"],
        ["0702", "人应该牢牢抓住自己的心：因为对它放任了，很快他的头脑也就失去控制了!", "忌忘我"],
        ["0703", "有些人，即使忘记了他的声音，忘记了他的笑容，忘记了他的脸，但是每当想起他时的那种感受，是永远都不会改变的。", "宜记得"],
        ["0704", "因为你把时间投注在你的玫瑰花身上，所以，她才会如此重要。", "《小王子》"],
        ["0705", "我们是唱歌的孩子，唱歌的孩子\n在阳光下，在榕树上\n有我们欢笑的脸庞", "《唱歌的孩子》"],
        ["0706", "从卖气球的人那里，每个孩子牵走一个心愿。", "宜胡思乱想"],
        ["0707", "生活坏到一定程度就会好起来，因为它无法更坏。努力过后，才知道许多事情，坚持坚持，就过来了。", "《龙猫》"],
        ["0708", "福是什么？知道福是什么就是福。", "宜知福"],
        ["0709", "如果你爱上了某个星球的一朵花。那么，只要在夜晚仰望星空，就会觉得漫天的繁星就像一朵朵盛开的花。", "宜心花怒放"],
        ["0710", "有一碗米给人家吃，自我饿着肚子，这叫帮人；一锅米你吃不了，给人家盛一碗，那叫人家帮你。", "《姥姥语录》"],
        ["0711", "姥姥说：“神就是你自我，你信他就有，你不信他就没有。”", "《姥姥语录》"],
        ["0712", "有多久没见你，以为你在哪里，原来就住在我心底，陪伴着我的呼吸。", "宜心动"],
        ["0713", "梦想是一个天真的词，实现梦想是一个残酷的词。", "宜脚踏实地"],
        ["0714", " “大雄也有个优点。那就是他会反省。他一直在努力去做一个更好的人。”", "宜反省"],
        ["0715", "我是长大成人了，还是，长成大人了。", "宜乡愁"],
        ["0716", "三观是什么？人生观是人这辈子应该怎么活，价值观是人这辈子什么才是最珍贵的，世界观是这个世界是怎么样的。", "宜求同存异"],
        ["0717", "人们的幸福并不取决于富有的程度，而是取决于心与心的关系和我们的生活观。", "宜有态度"],
        ["0718", "我不害怕由一只绵羊所带领的一群狮子，但我害怕由一只狮子所带领的一群绵羊", "宜温柔"],
        ["0719", "如果败了，我可以从头再来，如果胜了，我可以把脚下的基石夯硬", "忌畏惧"],
        ["0720", "刚开始是假装坚强，后来就真的坚强了。", "《我们仨》"],
        ["0721", "语言是误解的源头。", "忌管闲事"],
        ["0722", "所有的大人都曾经是小孩，虽然，只有少数的人记得。", "宜回首"],
        ["0723", "哆啦A梦 ： “努力保持悠闲自得的状态吧！”", "宜悠闲"],
        ["0724", "生命中最艰难的那段路是要自己一个人走过来的，这样，学到更多的是坚强，而不是感动。", "宜身披铠甲"],
        ["0725", "人一辈子会听到很多心里话，我很庆幸，因为我曾经听到过。", "宜以诚相待"],
        ["0726", "星星发亮是为了让每一个人有一天都能找到属于自己的星星。", "宜专注"],
        ["0727", "在大的时代里，个人正如一叶扁舟，唯有随波逐流，偶尔的讽刺、同情，但人也只能平静地一步步走向坟墓而已。命运于此，并不是一个悲剧，不过是巨大的讽刺。", "宜初心"],
        ["0728", "很多时候我们放弃\n以为不过是一段感情\n到了最后，才知道\n原来那是一生", "宜珍惜"],
        ["0729", "如果将人生一分为二，那么我们前半段人生哲学应该是“不犹豫”，而后半段的人生哲学应该是“不后悔”。", "宜把握"],
        ["0730", "我只是一滴清水，不是肥皂水，不能吹泡泡。", "宜平淡如水"],
        ["0731", "哆啦A梦 ：“已经发生的事儿，后悔也没用不是吗？你认为眼睛为什么长在前面？是为了向前进啊。”", "宜前进"],
      ],
      //8月
      [
        ["0800", "日期占位符，没有用到"],
        ["0801", "幸福九个字：有希望，有事干，有人爱。", "宜简单"],
        ["0802", "姥姥说：吃了一辈子小亏，占了一辈子大便宜……一辈子没有大幸福，小幸福一天一个。", "《姥姥语录》"],
        ["0803", "姥姥说：写书也不是个多大的事，你看人家也没写个啥，就是过日子那点油盐酱醋，烙个油饼炒个菜。", "《姥姥语录》"],
        ["0804", "有一次，大雄一直喝果汁饮料被妈妈骂说这样对身体不好，叫他口渴就喝水啊。大雄碎碎念「又不是金鱼，喝什么水」", "宜童真"],
        ["0805", "当一个人情绪低落的时候，他会格外喜欢看日落。", "宜沉静"],
        ["0806", "没问题的，别担心，一切都会好的。", "宜自由生长"],
        ["0807", "删了又写，写了又删，最后却只是发了一句“晚安”。", "宜相见"],
        ["0808", "生活总会给你另一个机会，这个机会叫明天。", "宜行动"],
        ["0809", "哆啦A梦 ：“无论学习上多么无能，打架时多么软弱，你也一定能在某处找到属于你自己的宝石。打造它让你的灵魂发出闪耀的光芒吧！”", "忌放弃"],
        ["0810", "大雄“我不想长高” “为什么” “因为我长高了哆啦A梦就不能牵到我的手了”", "宜挂念"],
        ["0811", "今后还会不断地栽跟头，但同时你也有了每次站起来的坚强。", "宜坚强"],
        ["0812", "哆啦A梦对大雄说：“你学什么都是这个样子，还没开始学就先退缩，你这样子学什么都不会。”", "宜相信自己"],
        ["0813", "你看，不倒翁站起来了，你也可以自己站起来啊！", "忌击倒"],
        ["0814", "所有的失望都是源于我凭空的期待。", "宜说到做到"],
        ["0815", "大雄 ：“好歹来这个世界一趟，总是要留下自己的足迹。”", "忌苍白"],
        ["0816", "假如条件允许，你最想开什么店？", "宜理想"],
        ["0817", "这世上只有一种成功，叫：“用自己喜欢的方式过一生”。", "宜独立"],
        ["0818", "“大雄也有个优点。那就是他会反省。他一直在努力去做一个更好的人。”", "宜发现优点"],
        ["0819", "举得起放得下叫举重，举得起放不下叫负重。", "忌沉重"],
        ["0820", "这世界笑了于是你合群的一起笑了。", "忌合群"],
        ["0821", "在你看别人的同时，你也是别人眼中的风景。", "宜温柔以待"],
        ["0822", "大雄 ：“什么事儿都是一开始会产生新鲜的感动。”", "宜新鲜"],
        ["0823", "话说出去之前你是话的主人，说出去后你是话的奴隶。", "忌空话"],
        ["0824", "世界这么大，人生这么长，总会有这么一个人，让你想要温柔对待。", "宜爱恋"],
        ["0825", "人生的某些障碍，你是逃不掉的。与其费尽周折绕过去，不如勇敢的地攀越，或许这会铸就你人生的高点。", "宜面对"],
        ["0826", "哆啦A梦 ： “如果有什么想做的，不忘我地投入是不行的。”", "宜投入"],
        ["0827", "法国人说酒是葡萄的回忆，经历了足够的时间之后，所有事实都必然产生微妙的改变，到达美丽的顶点后枯萎下去。", "宜沉淀"],
        ["0828", "如果再见不能红着脸，是否还能红着眼。", "宜回味"],
        ["0829", "纸短情长啊\n诉不完当时年少\n我的故事还是关于你呀", "《纸短情长》"],
        ["0830", "虽然不是世界第一，不过我的确是猫型机器人的前两三名。", "宜自信"],
        ["0831", "我太年轻了，甚至不懂怎么去爱她。", "《小王子》"],
      ],
      //9月
      [
        ["0900", "日期占位符，没有用到"],
        ["0901", "成长是一笔交易，我们都是用朴素的童真与未经人事的洁白交换长大的勇气。", "宜永葆青春"],
        ["0902", "什么时候，我们话少的只剩早安晚安了。", "宜走心"],
        ["0903", "一盅清茶，喝到凉却。一出戏，看到落幕。一生要修的功课，也会在某个掩卷的时刻，写上结局。", "宜平淡"],
        ["0904", "青春就像一场大雨，即使感冒了，也希望再淋一次。", "宜无悔"],
        ["0905", "我喜欢你，是我独家的记忆\n谁也不行，从我这个身体中拿走你", "《独家记忆》"],
        ["0906", "每一次告别，最好用力一点。多说一句，可能是最后一句。多看一眼，可能是最后一眼。", "忌敷衍"],
        ["0907", "思想如电钻，必须集中在一点钻下去才有力量。", "宜专注"],
        ["0908", "我发现好看的皮囊太多，于是我只能逼着自己的灵魂有声有色。", "宜风趣"],
        ["0909", "不管我们能不能再见\n不管你会不会忘了我 ", "宜无悔"],
        ["0910", "活着不是为了别人而是为了自己，这是我所拥有的骄傲。", "宜做自己"],
        ["0911", "我会住在其中的一颗星星上面，在某一颗星星上微笑着，每当夜晚你仰望星空的时候，就会像是看到所有的星星都在微笑一般。", "《小王子》"],
        ["0912", "我们的生命太短，来不及见证那些遥远到令人恍惚的词语，比如天长地久，海角天涯，碧落黄泉，沧海桑田。", "宜展望"],
        ["0913", "等待太久来的东西，多半已经不是自己当初想要的了。", "忌等待"],
        ["0914", "因为你，我愿意成为一个更好的人，不想成为你的包袱，因此发奋努力，只是为了想要证明我足以与你相配。", "宜担当"],
        ["0915", "把梦寄托在别人身上，是多么地不安全。", "宜自强"],
        ["0916", "十年后的自己，会朝着自己的梦想越走越近。", "宜仰望星空"],
        ["0917", "羡慕孩子的无忧无虑、看到花圈也只会觉得好看想折下一点戴在头上。", "宜天真无邪"],
        ["0918", "小时候，幸福很简单；长大了，简单很幸福。", "宜知返"],
        ["0919", "我们手里的金钱是保持自由的一种工具。", "忌贫穷"],
        ["0920", "我看过沙漠下暴雨\n看过大海亲吻鲨鱼\n看过黄昏追逐黎明\n没看过你", "宜奇妙能力"],
        ["0921", "人老的好处就是，已经没有什么可以失去的了。", "宜豁达"],
        ["0922", "“你不应该忘记，你要永远对你所驯服的一切负责，你要对你的玫瑰花尽责。”", "《小王子》"],
        ["0923", "兴高采烈地迎接每一场空欢喜\n是我最少年的事。", "忌空洞"],
        ["0924", "为了消灭这群“害人精”，我咬咬牙，闭闭眼，又将竹竿悄悄地伸向蜂窝，朝中间“啪”的一声捅去，接着便传来一阵“嗡嗡”声。", "宜童真"],
        ["0925", "当你无法再拥有时，你唯一能做的就是不要再忘记。", "宜珍重"],
        ["0926", "“大雄，如果要允许你许个愿望，你会最想要许的是什么。”“我想要哆啦A梦永远陪在我身边，永远不离开我。”", "宜陪伴"],
        ["0927", "哆啦A梦曾经问大雄：“如果给你一个没有口袋的哆啦A梦，你还要么？” “哈哈，那就不要了”回答的很干脆。于是，继续笑闹着，嘲笑着彼此的贪心。", "宜单纯"],
        ["0928", "一次大雄考零分，老师很生气，说为什么考零分。大雄：“零分是老师给的。”", "宜开心"],
        ["0929", "成功有个副作用，就是以为过去的做法同样适用于将来。", "宜复制成功"],
        ["0930", "每个外表开朗，整天欢脱的女汉子，都隐藏着一个安静脆弱的灵魂。", "宜保护"],
        ["0931", "没办法，有人群的地方就有左中右。", "宜泾渭分明"],
      ],

      //10月
      [
        ["1000", "日期占位符，没有用到"],
        ["1001", "所谓深情挚爱，就是你中有我，我中有你，原来，一个人吃饭没有两个人吃饭开心。", "宜真挚"],
        ["1002", "我只是卑微的小丑，翻几个跟斗，就等你拍一拍手。", "忌冷漠"],
        ["1003", "一颗说走就走的心\n一对很合拍的情侣\n一段甜蜜的旅程。", "宜诗意"],
        ["1004", "最美的不是下雨天，是曾与你躲过雨的屋檐。", "《不能说的秘密》"],
        ["1005", "使沙漠显得美丽的，是它在什么地方藏着一口水井。", "宜期待"],
        ["1006", "多年后，再回想这样的迷茫或许连执着的原因都记不得了，青春就是让你张扬的笑，也给你莫名的痛。", "忌忘记"],
        ["1007", "珍惜一切，就算没有拥有。", "《稻香》"],
        ["1008", "当胃很充实，人就不容易悲伤。", "宜好胃口"],
        ["1009", "时间会缓和所有的悲伤，当你的悲伤被安抚以后，你就会因为认识过我而感到满足。", "宜满足"],
        ["1010", "这世上并没有多少凑巧之事，许多凑巧，事后清算，皆是人为。", "忌听天由命"],
        ["1011", "你说这个世界上会不会一个故事从头到尾一直是幸福的呢？", "《后来的我们》"],
        ["1012", "不要让自己的理智和感情赛跑，适得其反的是越克制理智，感情就越一路领先。", "宜感性"],
        ["1013", "不是的，我也很喜欢静香，但我不希望这样靠机械（多啦A梦的道具）来获得你的心。", "忌套路"],
        ["1014", "快乐、陪伴、被关爱、不寂寞……这些，都是最清澈和最纯粹的。", "宜纯粹"],
        ["1015", "也许生存在世间的人们都只是在等待一种偶遇，一种适时的相遇，时间对了，你们便会遇上。", "宜相遇"],
        ["1016", "就是因为你不好，才要留在你身边，给你幸福。", "忌完美无瑕"],
        ["1017", "“我们来下棋好了，我会故意输给你的！”", "宜相知"],
        ["1028", "就算不快乐也不要皱眉，因为你永远不知道谁会爱上你的笑容。", "忌愁"],
        ["1019", "夫妻该是终身的朋友，夫妻间最重要的是朋友关系，即使不是知心的朋友，至少也该是能做伴侣的朋友或互相尊重的伴侣。", "杨绛语录"],
        ["1020", "事实上，这个世界不符合所有人的梦想，只是有人学会了遗忘，有人却一直坚持。", "忌迷失"],
        ["1021", "人永远不知道，谁哪次不经意的跟你说了再见之后，就真的不会再见了。", "忌漠视"],
        ["1022", "最远的旅行，是从自己的身体到自己的心，是从一个人的心到另一个人的心。", "宜追寻内心"],
        ["1023", "有时候，坚持了你最不想干的事情之后，便可得到你最想要的东西。", "忌颓废"],
        ["1024", "有时我沉默，不是不快乐，只是想把心净空。有时候你需要退开一点，清醒一下，然后提醒自己，我是谁，要去哪里。", "宜沉默"],
        ["1025", "回忆是一种很奇妙的东西，它生活在过去，存在于现在，却能影响未来。", "宜回忆"],
        ["1026", "一旦你驯服了什么，就要对她负责，永远的负责。", "《小王子》"],
        ["1027", "如果有所谓的太贫穷，不过是不敢再做梦。", "宜理想主义"],
        ["1028", "爱情这东西，时间很关键。认识得太早或太晚，都不行。", "忌错过"],
        ["1029", "缘分这事，能不负对方就好，想不负此生真的很难。", "《后来的我们》"],
        ["1030", "日子就像偷跑的小孩，无声地溜走。", "宜惜时"],
        ["1031", "我甘心当个“零”，人家不把我当个东西，我正好可以把看不起我的人看个透。", "忌虚伪"],
      ],

      //11月
      [
        ["1100", "日期占位符，没有用到"],
        ["1101", "狐狸：如果你驯养我，那我的生命就充满阳光，你的脚步声会变得跟其他人的不一样。", "《小王子》"],
        ["1102", "如果不去接触未知，我们的感觉将变得迟钝，我们的世界就那么小小的一点儿，就连好奇心也将消失不见。", "宜好奇"],
        ["1103", "永远年轻，永远热泪盈眶。", "宜清纯"],
        ["1104", "要有最朴素的生活， 与最遥远的梦想 。即使明日天寒地冻， 路远马亡。", "宜诗意生活"],
        ["1105", "两个人散了是因为一个以为不会走，一个以为会挽留。", "忌错过"],
        ["1106", "有的事情现在不做，就一辈子也不会做了。", "忌认怂"],
        ["1107", "学会随遇而安，淡然一点，走走停停。", "宜细水长流"],
        ["1108", "当胃很充实，人就不容易悲伤。", "宜满足"],
        ["1109", "珍惜一切，就算没有拥有。", "忌患得患失"],
        ["1110", "人生就像一场旅行，不必在乎目的地，在乎的是沿途的风景以及看风景的心情，让心灵去旅行!", "宜感受"],
        ["1111", "既然是大雄说的话，我又怎么会怀疑呢？", "宜信任"],
        ["1112", "在一个陌生的地方，发现一种久违的感动。", "宜发现"],
        ["1113", "不停的挑战生活，再与之言和", "忌碌碌无为"],
        ["1114", "你走，我不送你。你来，无论多大风多大雨，我要去接你。", "宜相守"],
        ["1115", "也许故乡小，却比异乡好。", "宜思念"],
        ["1116", "梦倒塌的地方\n把青苔清理干净\n我又筑起了我的梦。", "宜寂静生长"],
        ["1117", "我们曾如此渴望命运的波澜，到最后才发现：人生最曼妙的风景，竟是内心的淡定与从容；我们曾如此期盼外界的认可，到最后才知道，世界是自己的，与他人毫无关系。", "杨绛《一百岁感言》"],
        ["1118", "删了又写，写了又删，最后却只是发了一句“晚安”。", "宜无话不谈"],
        ["1119", "生活总会给你另一个机会，这个机会叫明天。", "宜期待"],
        ["1120", "一个笑就击败了一辈子，一滴泪就还清了一个人。一人花开，一人花落，这些年从头到尾，无人问询。", "忌逞强"],
        ["1121", "你的过去我来不及参与，你的未来我奉陪到底。", "宜温暖"],
        ["1122", "读别人，其实也在读自己，读真、读善、读美的同时，也读道貌岸然背后的伪善，也读美丽背后的丑恶，也读微笑背后的狡诈。", "宜知己知彼"],
        ["1123", "人和人的出场顺序很重要。陪你酩酊大醉的人，是没办法送你回家的。", "宜认清"],
        ["1124", "时光偷走的，永远是你眼皮底下看不见的珍贵。", "宜珍贵"],
        ["1125", "蒲公英，无牵无挂，无欲无求，风起而行，风静而安。", "宜平淡"],
        ["1126", "许多事，因为美丽而遥远，因为无奈的一声叹息而永存。", "忌犹豫"],
        ["1127", "我们是唱歌的孩子，唱歌的孩子\n在阳光下，在榕树上\n有我们欢笑的脸庞", "《唱歌的孩子》"],
        ["1128", "如果你要驯服一个人，就要冒着掉眼泪的危险。", "《小王子》"],
        ["1129", "世界一直在改变，昨天和今天完全不同，当初多么神圣的观念，现在看起来是多么的可笑与幼稚。", "忌后悔"],
        ["1130", "一举一动，都是承诺，会被另一个人看在眼里，记在心上的。", "宜心动"],
        ["1131", "有爱我的人，有条件胡闹，想怎样，怎么样都讨好。", "宜任性"],
      ],
      //12月
      [
        ["1200", "日期占位符，没有用到"],
        ["1201", "到不了的地方都叫做远方，回不去的世界都叫做家乡。", "宜初心不改"],
        ["1202", "在一片片凋落地回忆里，你的模样是否已变化。", "宜歌唱"],
        ["1203", "钱钟书：遇到你之前，我从没想过结婚 遇到你之后，我结婚没有想过和别的人。", "宜真情"],
        ["1204", "努力过后才知道许多事情，坚持坚持就过来了。", "宜坚持"],
        ["1205", "不管受了再大的委屈，常常咬一咬牙就挺过去了，可是当身边有一个人关心时，却会忍不住呼疼、掉眼泪。", "忌逞强"],
        ["1206", "而我已经分不清，你是友情还是错过的爱情。", "《蒲公英的约定》"],
        ["1207", "重要的不是风景，而是脚下的路。是始终行走着的双脚让我成长。", "宜勇敢"],
        ["1208", "当遗忘变成另一种开始，淡了回忆，痛最真实。", "忌遗忘"],
        ["1209", "哪里会有人喜欢孤独，不过是不喜欢失望。", "宜梦想成真"],
        ["1210", "在被遗忘的角落里，也要开出绝美的花儿，你绝不是为了别人的赞美而存在。", "宜欣赏"],
        ["1211", "我是一个经常笑的人，可我不是经常开心的人。", "忌假面"],
        ["1212", "从今以后，咱们只有死别，不再生离。", "《我们仨》"],
        ["1213", "我假装无所谓，告诉我自己，我那么的坚强，我可以承受一切的。可是，当我被遗忘在角落的时候，我才发现，我输不起，我会害怕。", "宜寄托"],
        ["1214", "我们一路上兴致勃勃地参观，当夕阳西下时，才恋恋不舍地离开。", "宜同行"],
        ["1215", "把梦寄托在别人身上，是多么地不安全。", "宜成长"],
        ["1216", "十年后的自己，会朝着自己的梦想越走越近。", "忌颓废"],
        ["1217", "羡慕孩子的无忧无虑、看到花圈也只会觉得好看想折下一点戴在头上。", "宜天真"],
        ["1218", "小时候，幸福很简单；长大了，简单很幸福。", "宜单纯"],
        ["1219", "青春是一本太仓促的书，我们含着泪，一读再读。", "宜活在当下"],
        ["1220", "因为你，我愿意成为一个更好的人，不想成为你的包袱，因此发奋努力，只是为了想要证明我足以与你相配。", "宜努力"],
        ["1221", "一个人只有用心去看，才能看到真实。事情的真相只用眼睛是看不见的。", "忌蒙蔽"],
        ["1222", "每个人心中，都会有一个古镇情怀，流水江南，烟笼人家。", "宜计划"],
        ["1223", "有的路，是脚去走。有的路，要心去走。绊住脚的，往往不是荆棘和石头，而是心。", "忌犹豫"],
        ["1224", "一个人自以为很牺牲的时候，一定也有人默默在陪着牺牲。", "忌自我"],
        ["1225", "如果，我的一句开玩笑的话，让你那么生气，那么对不起，我以为我们很熟。", "宜相知"],
        ["1226", "回忆是一种很奇妙的东西，它生活在过去，存在于现在，却能影响未来。", "宜回忆"],
        ["1227", "人永远不知道，谁哪次不经意的跟你说了再见之后，就真的不会再见了。", "宜珍惜"],
        ["1228", "时光静好，与君语；细水流年，与君同；繁华落尽，与君老。", "宜生活"],
        ["1229", "我的那朵玫瑰，别人会以为她和你们一样，但她单独一朵就胜过你们全部。因为她是我的玫瑰。", "《小王子》"],
        ["1230", "流转的时光，都成为命途中美丽的点缀，看天，看雪，安安静静，不言不语都是好风景。", "宜欣赏"],
        ["1231", "不要对别人轻易许诺，因为很多话，只有听的人会记得。", "忌轻易许诺"],
      ],
    ],

    festivals: [
      ["0101", "元旦", "岁月轮回，我们都回不到最初样子", "宜期待"],
      ["0214", "情人节", "很多时候我们放弃\n以为不过是一段感情\n到了最后\n才知道\n原来那是一生", "宜珍惜"],
      ["0307", "女生节", "高校横幅大战又来了———\n回望来路，你是最美的风景", "宜少女心"],
      ["0308", "妇女节", "虽然老娘不过妇女节\n但礼物必须得到位！！！", "宜霸道"],
      ["0312", "植树节", "种下一棵树最好的时间是十年前，\n其次是现在。", "宜开始"],
      ["0321", "世界睡眠日", "人是铁打的，床是磁铁打的...", "忌熬夜"],
      ["0401", "愚人节", "我哆啦A梦认为：告白需要认真一点吧，愚人节告白的请走开！", "宜认真"],
      ["0424", "中国航天日", "我想飞上天和太阳肩并肩\n世界等着我去改变", "宜想象"],
      ["0430", "国际不打小孩日", "不是指今天不打改日再打哦", "宜纯真"],
      ["0501", "劳动节", "只放假一天\n五一变成了名副其实的劳动节", "宜休息"],
      ["0508", "世界微笑日", "让我们嘴角上翘，用微笑对抗地心引力", "宜元气满满"],
      ["0520", "520", "无法改变雨天\n但是我愿为你撑起一道彩虹", "宜陪伴"],
      ["0601", "儿童节", "真诚，简单，善良，快乐，感恩", "宜童真"],
      ["0706", "国际接吻日", "不能随便过，更不能和随便的人过", "宜相守"],
      ["0901", "开学", "哆啦A梦要背上书包上学去啦~~", "宜勿忘初心"],
      ["1031", "世界勤俭日", "自己动手，丰衣足食", "忌挥霍"],
      ["1111", "双十一", "当初用淘宝是想省钱来着，没想到钱花的更多了~", "宜剁手"],
      ["1204", "生日", "老娘我永远十八岁！！！", "宜感动"],
      ["1224", "平安夜", "You Are the Apple of My Eyes.", "宜平安"],
      ["1225", "圣诞节", "我们在意每一个节日的仪式感。", "宜开心"],
    ],
    lunarFestivals: [
      ["腊月三十", "除夕", "花开花谢，此消彼长，云卷云舒，一年又一年！", "除夕夜快乐"],
      ["正月初一", "过年", "在外面做个大人，在家永远是个孩子", "新年好"],
      ["正月初二", "过年", "不管距离有多么远，关怀你的心不变", "宜祝福"],
      ["正月初三", "过年", "所有的希望都如愿，所有的梦想都实现", "宜梦想"],
      ["正月初四", "过年", "平平安安，开开心心，健健康康", "宜潇洒"],
      ["正月初五", "迎财神", "人生中最美好的东西是不要钱的", "宜知足"],
      ["正月初六", "过年", "节假日的最后一天，未来事事顺心奥！", "宜开心"],
      ["正月初七", "过年", "期许新的未来，充满了希望与光明！", "宜真心"],
      ["正月十五", "元宵节", "每逢佳节胖三斤，仔细一瞧三公斤！", "宜团圆"],
      ["五月初五", "端午节", "哆啦A梦馅儿的粽子吃过没？", "宜新鲜感"],
      ["七月初七", "七夕节", "孤独漫长了时间，相遇诗意了流年。\n未来的你在我身边，便是我希望的永远。", "宜情话"],
      ["八月十五", "中秋节", "月光正好，思念正浓。", "宜团聚"],
    ],
    jieqiFestival: [
      ["冬至", "冬至", "记得你爱吃水饺，虾仁三鲜馅儿的。\n今天你吃过了吗？", "宜温暖"],
    ],

    html: {
      data: {
        cnmonth: "xxxx",
        cnday: "xx",
        animal: "xx",
        year: "xxxx",
        month: "xx",
        day: "xx",
        week: "xxx"
      }
    },

    backgroundImage: "../../images/image_doraemon100.png",
    timeYMD: "", //用于显示时间 YYYY/MM/DD
    timeMD: "", //分割出 MMDD 用于检测是否是节日
    sayHello: "", //记录早午晚安
    lunarMD: "", //用于显示阴历
    dongzhiMD: "", //只用来找“冬至”这天 MMDD 

    //month和day用来获取suitable[month][day][1]的句子，suitable[month][day][2]事宜
    modalImage: "../../images/image_doraemon101.png",
    modalHidden: true,
    modalLogion: "",
    modalSuitable: "",
  },

  onLoad: function () {
    var that = this
    wx.getSystemInfo({
      success: function (res) {
        console.log('height=' + res.windowHeight);
        that.setData({
          second_height: res.windowHeight
        })
      }
    })
    console.log(this.data.second_height);

    var TIME = util.formatTime(new Date());
    var month = TIME.split("/")[1];
    var day = (TIME.split("/")[2]).split(" ")[0];
    var monthDay = month + day;
    var hour = (TIME.split(" ")[1]).split(":")[0];
    console.log("onLoad初始加载 ", TIME);
    console.log("onLoad初始加载 ", monthDay);
    var say = "";
    if (hour >= "05" && hour <= "07") {
      say = "早安~";
    } else if (hour >= "08" && hour <= "11") {
      say = "上午好~";
    } else if (hour >= "12" && hour <= "13") {
      say = "午安~"
    } else if (hour >= "14" && hour <= "18") {
      say = "下午好~"
    } else if (hour >= "19" && hour <= "22") {
      say = "晚上好~"
    } else {
      say = "晚是世界的晚\n安是给你的安";
    }
    this.setData({
      timeYMD: TIME.split(" ")[0],
      timeMD: monthDay,
      sayHello: say,
    })

    var self = this;
    wx.request({
      //仅用来搜农历就行，还有找冬至在哪天，做好请求失败的处理
      url: 'https://www.sojson.com/open/api/lunar/json.shtml',
      data: {},
      header: {
        "Content-Type": "application/json"
      },

      success: function (res) {
        console.log("onLoad初始加载 ", res);
        if (res.statusCode == 200) {
          if (res.data.message == "success") {
            //请求成功
            console.log("onLoad初始加载：分解阴历、查找冬至");

            var dongzhiMonthDay = "";
            //查找冬至
            // TODO !!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!
            //这里用大寒做测试！！！！！！！！！！！！！！！！！！！！！！！！！！！！！！
            for (var index = 1; index <= 31; index++) {
              if (res.data.data.jieqi[index] == "冬至") { //这里用大寒做测试
                console.log("onLoad初始加载 查找[冬至] index:", index, res.data.data.jieqi[index]);
                dongzhiMonthDay = month + index;
                console.log("冬至阳历日期", dongzhiMonthDay);
              }
            }

            self.setData({
              html: res.data,
              lunarMD: res.data.data.cnmonth + "月" + res.data.data.cnday,
              dongzhiMD: dongzhiMonthDay,
            })
          }
          console.log("onLoad初始加载：结束分解阴历、查找冬至");
        }
      }
    })

    var todayImage = "../../images/image_doraemon101.png";
    var todayLogion = this.data.suitable[month - 0][day - 0][1];
    var todaySuitable = this.data.suitable[month - 0][day - 0][2];
    //jieqiFestival、lunarFestival数组检测(request貌似是异步的，不能顺序执行)
    //festivals数组检测
    for (var index = 0; index <= 19; index++) {
      if (monthDay == this.data.festivals[index][0]) {
        todayImage = "../../festivals/image_doraemon_" + this.data.festivals[index][1] + ".png";
        todayLogion = this.data.festivals[index][1] + "啦~~\n" + this.data.festivals[index][2];
        todaySuitable = this.data.festivals[index][3];
        console.log("onLoad初始加载： isFestival ", monthDay);
        break;
      }
    }

    this.setData({
      modalImage: todayImage,
      modalHidden: true,
      modalLogion: todayLogion,
      modalSuitable: todaySuitable,
    })
    console.log("onLoad初始加载 modalImage:", this.data.modalImage);
    console.log("onLoad初始加载 modalLogion:", this.data.modalLogion);
    console.log("onLoad初始加载 modalSuitable:", this.data.modalSuitable);

  },

  // 功能：节日的判断与图片，跨时的sayHello的切换；跨天的图片切换
  modalTap: function (e) {
    //获取当前时间，进行跨时的判断
    var TIME = util.formatTime(new Date());
    var month = TIME.split("/")[1];
    var day = (TIME.split("/")[2]).split(" ")[0];
    var monthDay = month + day;
    var hour = (TIME.split(" ")[1]).split(":")[0];
    console.log("modal点击事件：", TIME);
    console.log("modal点击事件：", monthDay);
    var say = "";
    if (hour >= "05" && hour <= "07") {
      say = "早安~";
    } else if (hour >= "08" && hour <= "11") {
      say = "上午好~";
    } else if (hour >= "12" && hour <= "13") {
      say = "午安~"
    } else if (hour >= "14" && hour <= "18") {
      say = "下午好~"
    } else if (hour >= "19" && hour <= "22") {
      say = "晚上好~"
    } else {
      say = "晚是世界的晚\n安是给你的安";
    }
    this.setData({
      sayHello: say,
    })

    //jieqiFestival、lunarFestival数组检测(request是异步的，不能顺序执行)
    //lunarFestival用的是加载先request阴历，在点击button后在进行节日检索（请求和检索分开）
    console.log("modal点击事件：检索阴历节日 this.data.lunarMD:", this.data.lunarMD);
    for (var index = 0; index <= 11; index++) {
      if (this.data.lunarMD == this.data.lunarFestivals[index][0]) {
        var todayImage = "../../festivals/image_doraemon_" + this.data.lunarFestivals[index][1] + ".png";
        var todayLogion = this.data.lunarFestivals[index][1] + "啦~~\n" + this.data.lunarFestivals[index][2];
        var todaySuitable = this.data.lunarFestivals[index][3];
        this.setData({
          modalImage: todayImage,
          modalLogion: todayLogion,
          modalSuitable: todaySuitable,
        })
        console.log("modal点击事件： isFestival ", todayImage);
        break;
      }
    }
    console.log("modal点击事件 阴历节日检索完毕");

    console.log("modal点击事件 冬至开始检索");
    console.log("modal点击事件 this.data.dongzhiMD:", this.data.dongzhiMD);
    console.log("modal点击事件 monthDay:", monthDay);
    if (this.data.dongzhiMD == monthDay) {
      console.log("jieqiFestival:", this.data.jieqiFestival);
      console.log("modal this.data.jieqiFestival[0][1]:", this.data.jieqiFestival[0][1]);
      var todayImage = "../../festivals/image_doraemon_" + this.data.jieqiFestival[0][1] + ".png";
      var todayLogion = this.data.jieqiFestival[0][2];
      var todaySuitable = this.data.jieqiFestival[0][3];
      console.log("modal  todayImage:", todayImage);
      console.log("modal  todayLogion:", todayLogion);
      console.log("modal  todaySuitable:", todaySuitable);
      this.setData({
        modalImage: todayImage,
        modalLogion: todayLogion,
        modalSuitable: todaySuitable,
      })
      console.log("modal点击事件： isFestival ", todayImage);
    }
    console.log("modal点击事件 冬至检索完毕")


    //判断阳历日期变了，再去发起阴历查询的请求，避免多次的频繁的API请求
    var lastMonthDay = this.data.timeMD;
    console.log("modal点击事件,last_monthDay: ", lastMonthDay);
    console.log("modal点击事件,此次的monthDay: ", monthDay);

    // Start for test!!!!!!!!!!!!!!!!!
    //month = "11";
    //day = "17";
    //monthDay = month + day;
    // End !!!!!!!!!!!!!!!!!!!!!

    if (lastMonthDay != monthDay) {
      console.log("modal点击事件，跨天事件满足");
      //请求阴历日期
      var self = this;
      wx.request({
        url: 'https://www.sojson.com/open/api/lunar/json.shtml',
        data: {},
        header: {
          "Content-Type": "application/json"
        },
        success: function (res) {
          console.log("modal点击事件", res);
          if (res.statusCode == 200) { //查询成功
            console.log("modal点击事件：分解阴历");
            if (res.data.message == "success") {
              self.setData({
                html: res.data,
                lunarMD: res.data.data.cnmonth + "月" + res.data.data.cnday,
              })
            }
          }
        }
      })

      var todayImage = "../../images/image_doraemon101.png";
      var todayLogion = this.data.suitable[month - 0][day - 0][1];
      var todaySuitable = this.data.suitable[month - 0][day - 0][2];
      console.log("test  monthDay", monthDay);
      console.log("test  this.data.festivals[index][0]", this.data.festivals[0][0]);

      for (var index = 0; index <= 19; index++) {
        if (monthDay == this.data.festivals[index][0]) {
          todayImage = "../../festivals/image_doraemon_" + this.data.festivals[index][1] + ".png";
          todayLogion = this.data.festivals[index][1] + "啦~~\n" + this.data.festivals[index][2];
          todaySuitable = this.data.festivals[index][3];
          console.log("modal： isFestival ", monthDay);
          break;
        }
      }
      this.setData({
        modalImage: todayImage,
        modalLogion: todayLogion,
        modalSuitable: todaySuitable,
        timeYMD: TIME.split(" ")[0],
        timeMD: monthDay,
      })
    }
    this.setData({
      modalHidden: false,
    })

  },

  modalConfirm: function (e) {
    this.setData({
      modalHidden: true,
    }),
      console.log(e);
  },

})